#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.asg.aws_autoscaling_attachment.cloudx will be created
  + resource "aws_autoscaling_attachment" "cloudx" {
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
      + lb_target_group_arn    = (known after apply)
    }

  # module.asg.aws_autoscaling_group.cloudx will be created
  + resource "aws_autoscaling_group" "cloudx" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 6
      + metrics_granularity       = "1Minute"
      + min_size                  = 3
      + name                      = "cloudx"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id   = (known after apply)
          + name = (known after apply)
        }

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "Development"
        }
      + tag {
          + key                 = "Owner"
          + propagate_at_launch = true
          + value               = "Roman_Izvozchikov"
        }
      + tag {
          + key                 = "Project"
          + propagate_at_launch = true
          + value               = "CloudX"
        }
      + tag {
          + key                 = "Terraform"
          + propagate_at_launch = true
          + value               = "true"
        }
    }

  # module.iam.aws_iam_instance_profile.cloudx will be created
  + resource "aws_iam_instance_profile" "cloudx" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "cloudx"
      + path        = "/"
      + role        = "cloudx"
      + tags_all    = {
          + "Environment" = "Development"
          + "Name"        = "cloudx"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + unique_id   = (known after apply)
    }

  # module.iam.aws_iam_policy.cloudx will be created
  + resource "aws_iam_policy" "cloudx" {
      + arn         = (known after apply)
      + description = "cloudx"
      + id          = (known after apply)
      + name        = "cloudx"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:Describe*",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "ssm:GetParameter*",
                          + "secretsmanager:GetSecretValue",
                          + "kms:Decrypt",
                          + "elasticfilesystem:DescribeFileSystems",
                          + "elasticfilesystem:ClientMount",
                          + "elasticfilesystem:ClientWrite",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "Development"
          + "Name"        = "cloudx"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
    }

  # module.iam.aws_iam_role.cloudx will be created
  + resource "aws_iam_role" "cloudx" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ec2.amazonaws.com",
                              + "ecs-tasks.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloudx"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "Development"
          + "Name"        = "cloudx"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.iam.aws_iam_role_policy_attachment.cloudx will be created
  + resource "aws_iam_role_policy_attachment" "cloudx" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cloudx"
    }

  # module.igw.aws_internet_gateway.cloudx will be created
  + resource "aws_internet_gateway" "cloudx" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = {
          + "Environment" = "Development"
          + "Name"        = "cloudx"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.key_pair.aws_key_pair.ssh_key will be created
  + resource "aws_key_pair" "ssh_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "cloudx"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDVrkAYksUEuOC5nEr2P7SjMBM5IwNM1JONgc6FJy7m6ah7kDgBD7Eas0K7XTFeco6uKN2F2wLNd7zeyFxKjQN3gpWant0Olq0b7qXUJhgjwLv/E5ha8UikfkhhrVpVuA6UkLllwE5RtyJDMHQHvLJfrsW0fGA3P/nb8psLAmsNNHM0nJsnEe6XPc7OcVZMpwzo4QJvaCh2ctZTfOAJG/BafSEi/kea5XO237Yg52YBBeT/rxSSuMA38BvdnykGWBCU0Z4GCa/a+5qBHXuH5VjvaUnlCzQWFokzUWm7YM0mMB+71t6MzaMPcFZtIvVXzMXFytmY0mVsOLcb7Zq8l6B+kk+/f5Q8shPAiD5h0K/d+664ffk47/iBH8/duiyGXtpnUzfCxC0drJ7pg02wohgQrT7i7vEkQHW/GN7mwXmKUcptPHmo83fDJehFfmQj61xXQWX8a/tBoHKKvYbBAO8hpn2JgEUdKuOYnaHvivbRYkoadbDZ57j8ykfhC7tKpzAcci2GgS2neWAx8ykq36DPIhipUojtS6oP6v8n78Gqk/BiILCm7zt9BkWn4nHDE2LRwQXuWSbT94O6XKA+doa9x5J0Q6xwSnnYvyHhnmovKtrrigk5Q52QogOIeIIGGstBsMM1CNXR1j27RZXL8YLluQO/EswLHpSgiYyeYChTow== roman@ubuntu"
      + tags_all        = {
          + "Environment" = "Development"
          + "Name"        = "cloudx"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
    }

  # module.launch_template.aws_launch_template.cloudx will be created
  + resource "aws_launch_template" "cloudx" {
      + arn                                  = (known after apply)
      + default_version                      = (known after apply)
      + id                                   = (known after apply)
      + image_id                             = "ami-033b95fb8079dc481"
      + instance_initiated_shutdown_behavior = "terminate"
      + instance_type                        = "t2.micro"
      + key_name                             = (known after apply)
      + latest_version                       = (known after apply)
      + name                                 = "cloudx"
      + name_prefix                          = (known after apply)
      + tags_all                             = {
          + "Environment" = "Development"
          + "Name"        = "cloudx"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interfaces {
          + associate_public_ip_address = "true"
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Environment" = "Development"
              + "Name"        = "cloudx"
              + "Owner"       = "Roman_Izvozchikov"
              + "Project"     = "CloudX"
              + "Terraform"   = "true"
            }
        }
    }

  # module.lb.aws_lb.cloudx will be created
  + resource "aws_lb" "cloudx" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "cloudx"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags_all                   = {
          + "Environment" = "Development"
          + "Name"        = "cloudx"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + outpost_id = (known after apply)
          + subnet_id  = (known after apply)
        }
      + subnet_mapping {
          + outpost_id = (known after apply)
          + subnet_id  = (known after apply)
        }
      + subnet_mapping {
          + outpost_id = (known after apply)
          + subnet_id  = (known after apply)
        }
    }

  # module.lb.aws_lb_listener.cloudx will be created
  + resource "aws_lb_listener" "cloudx" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Environment" = "Development"
          + "Name"        = "cloudx"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }

      + default_action {
          + order = (known after apply)
          + type  = "forward"

          + forward {

              + target_group {
                  + arn    = (known after apply)
                  + weight = 1
                }
            }
        }
    }

  # module.lb.aws_lb_target_group.cloudx will be created
  + resource "aws_lb_target_group" "cloudx" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "cloudx"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Environment" = "Development"
          + "Name"        = "cloudx"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.nat_gw.data.aws_internet_gateway.cloudx will be read during apply
  # (config refers to values not yet known)
 <= data "aws_internet_gateway" "cloudx"  {
      + arn                 = (known after apply)
      + attachments         = (known after apply)
      + id                  = (known after apply)
      + internet_gateway_id = (known after apply)
      + owner_id            = (known after apply)
      + tags                = (known after apply)
    }

  # module.nat_gw.aws_eip.nat-gw[0] will be created
  + resource "aws_eip" "nat-gw" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "eip-for-nat-gw-1"
        }
      + tags_all             = {
          + "Environment" = "Development"
          + "Name"        = "eip-for-nat-gw-1"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc                  = true
    }

  # module.nat_gw.aws_eip.nat-gw[1] will be created
  + resource "aws_eip" "nat-gw" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "eip-for-nat-gw-2"
        }
      + tags_all             = {
          + "Environment" = "Development"
          + "Name"        = "eip-for-nat-gw-2"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc                  = true
    }

  # module.nat_gw.aws_eip.nat-gw[2] will be created
  + resource "aws_eip" "nat-gw" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "eip-for-nat-gw-3"
        }
      + tags_all             = {
          + "Environment" = "Development"
          + "Name"        = "eip-for-nat-gw-3"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc                  = true
    }

  # module.nat_gw.aws_nat_gateway.cloudx[0] will be created
  + resource "aws_nat_gateway" "cloudx" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "nat-gw-1"
        }
      + tags_all             = {
          + "Environment" = "Development"
          + "Name"        = "nat-gw-1"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
    }

  # module.nat_gw.aws_nat_gateway.cloudx[1] will be created
  + resource "aws_nat_gateway" "cloudx" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "nat-gw-2"
        }
      + tags_all             = {
          + "Environment" = "Development"
          + "Name"        = "nat-gw-2"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
    }

  # module.nat_gw.aws_nat_gateway.cloudx[2] will be created
  + resource "aws_nat_gateway" "cloudx" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "nat-gw-3"
        }
      + tags_all             = {
          + "Environment" = "Development"
          + "Name"        = "nat-gw-3"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
    }

  # module.route_table.aws_route.route_private[0] will be created
  + resource "aws_route" "route_private" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.route_table.aws_route.route_private[1] will be created
  + resource "aws_route" "route_private" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.route_table.aws_route.route_private[2] will be created
  + resource "aws_route" "route_private" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.route_table.aws_route.route_public will be created
  + resource "aws_route" "route_public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.route_table.aws_route_table.private_rt[0] will be created
  + resource "aws_route_table" "private_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "RT-Private-us-east-1a"
        }
      + tags_all         = {
          + "Environment" = "Development"
          + "Name"        = "RT-Private-us-east-1a"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.route_table.aws_route_table.private_rt[1] will be created
  + resource "aws_route_table" "private_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "RT-Private-us-east-1b"
        }
      + tags_all         = {
          + "Environment" = "Development"
          + "Name"        = "RT-Private-us-east-1b"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.route_table.aws_route_table.private_rt[2] will be created
  + resource "aws_route_table" "private_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "RT-Private-us-east-1c"
        }
      + tags_all         = {
          + "Environment" = "Development"
          + "Name"        = "RT-Private-us-east-1c"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.route_table.aws_route_table.public_rt will be created
  + resource "aws_route_table" "public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags_all         = {
          + "Environment" = "Development"
          + "Name"        = "cloudx"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.route_table.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_table.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_table.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_table.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_table.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_table.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.sg.aws_security_group.private will be created
  + resource "aws_security_group" "private" {
      + arn                    = (known after apply)
      + description            = "allows access for private networks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "all"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "http"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "private"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG-Private"
        }
      + tags_all               = {
          + "Environment" = "Development"
          + "Name"        = "SG-Private"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.sg.aws_security_group.private_db will be created
  + resource "aws_security_group" "private_db" {
      + arn                    = (known after apply)
      + description            = "allows access for private_db networks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "all"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "http"
              + from_port        = 8081
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8081
            },
        ]
      + name                   = "private_db"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG-Private_DB"
        }
      + tags_all               = {
          + "Environment" = "Development"
          + "Name"        = "SG-Private_DB"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.sg.aws_security_group.public will be created
  + resource "aws_security_group" "public" {
      + arn                    = (known after apply)
      + description            = "allows access for public networks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "all"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "http"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "public"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG-Public"
        }
      + tags_all               = {
          + "Environment" = "Development"
          + "Name"        = "SG-Public"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.subnet.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.21.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private-us-east-1a-1"
        }
      + tags_all                                       = {
          + "Environment" = "Development"
          + "Name"        = "Private-us-east-1a-1"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.22.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private-us-east-1b-2"
        }
      + tags_all                                       = {
          + "Environment" = "Development"
          + "Name"        = "Private-us-east-1b-2"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.23.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private-us-east-1c-3"
        }
      + tags_all                                       = {
          + "Environment" = "Development"
          + "Name"        = "Private-us-east-1c-3"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.private[3] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.31.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private-us-east-1a-4"
        }
      + tags_all                                       = {
          + "Environment" = "Development"
          + "Name"        = "Private-us-east-1a-4"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.private[4] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.32.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private-us-east-1b-5"
        }
      + tags_all                                       = {
          + "Environment" = "Development"
          + "Name"        = "Private-us-east-1b-5"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.private[5] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.33.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private-us-east-1c-6"
        }
      + tags_all                                       = {
          + "Environment" = "Development"
          + "Name"        = "Private-us-east-1c-6"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public-us-east-1a"
        }
      + tags_all                                       = {
          + "Environment" = "Development"
          + "Name"        = "Public-us-east-1a"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public-us-east-1b"
        }
      + tags_all                                       = {
          + "Environment" = "Development"
          + "Name"        = "Public-us-east-1b"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.13.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public-us-east-1c"
        }
      + tags_all                                       = {
          + "Environment" = "Development"
          + "Name"        = "Public-us-east-1c"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.cloudx will be created
  + resource "aws_vpc" "cloudx" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.10.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = {
          + "Environment" = "Development"
          + "Name"        = "cloudx"
          + "Owner"       = "Roman_Izvozchikov"
          + "Project"     = "CloudX"
          + "Terraform"   = "true"
        }
    }

Plan: 45 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + asg                 = (known after apply)
  + availability_zones  = [
      + "us-east-1a",
      + "us-east-1b",
      + "us-east-1c",
    ]
  + aws_iam_role        = (known after apply)
  + igw_id              = (known after apply)
  + instance_profile    = (known after apply)
  + key_pair            = (known after apply)
  + launch_template     = (known after apply)
  + lb                  = (known after apply)
  + nat_gw              = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_rt          = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_rt           = (known after apply)
  + sg_private          = (known after apply)
  + sg_private_db       = (known after apply)
  + sg_public           = (known after apply)
  + subnets_private     = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + subnets_private_db  = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + subnets_private_ec2 = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + subnets_public      = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vpc_id              = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @nVizzz, Action: `pull_request`*